---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RiserToTreadConnectionOption.JoinAll
enum: Autodesk.Revit.DB.Architecture.RiserToTreadConnectionOption
source: html/871e2085-3752-a39d-db79-d7257c5c1c0b.htm
---
# Autodesk.Revit.DB.Architecture.RiserToTreadConnectionOption.JoinAll

The connection will join all risers and treads.